### 🔧 Bootstrap Terraform Plan

```hcl
local_sensitive_file.ssh_key: Refreshing state... [id=f6bef8bf75abefb62ee12a1e5d4dc5fffd3bede3]
kubernetes_namespace.platform: Refreshing state... [id=platform]
null_resource.k3s_server: Refreshing state... [id=127050603283306056]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.bootstrap: Refreshing state... [id=bootstrap]
cloudflare_record.root: Refreshing state... [id=6af3d1fa49c3d911892f195a4c7fd6c4]
cloudflare_record.wildcard_public: Refreshing state... [id=ad4c7065dfdc814f8fceb49ebe907ae4]
cloudflare_record.infra_records["kapi"]: Refreshing state... [id=281f5c2bf647990805ca894fc0631038]
cloudflare_record.x_staging: Refreshing state... [id=994d200bafbce9b2e8c0c3d1b4536678]
cloudflare_record.infra_records["auth"]: Refreshing state... [id=76f911197685888fb53b7491a4ad5b1c]
cloudflare_record.infra_records["sso"]: Refreshing state... [id=70ad91913df52a16ec8902afdb9bb6e1]
cloudflare_record.infra_records["secrets"]: Refreshing state... [id=fd7459cadcd7cc6b278b3cf48a0b1398]
cloudflare_record.infra_records["kdashboard"]: Refreshing state... [id=8ed6a6305893dd0bdead535fd5d45016]
cloudflare_record.infra_records["signoz"]: Refreshing state... [id=5b90434833452b7d428d61c7d33c1263]
cloudflare_record.infra_records["home"]: Refreshing state... [id=b3a26757041f1edd4d855554356d2084]
cloudflare_record.infra_records["kcloud"]: Refreshing state... [id=6f06ad93f69bd78245fdfe8a57ddd189]
cloudflare_record.infra_records["openpanel"]: Refreshing state... [id=96fe6a95fd7414d551adc36bdd9c3176]
cloudflare_record.infra_records["k3s"]: Refreshing state... [id=34540150c83277063b0e8752aabbe4d3]
cloudflare_record.wildcard_internal[0]: Refreshing state... [id=d2abf7cd2683a09c2158d35e009219f7]
cloudflare_record.infra_records["digger"]: Refreshing state... [id=9fc7192d978f4a4a56c099b4498369e4]
null_resource.kubeconfig: Refreshing state... [id=7352832925648048633]
helm_release.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_secret.cloudflare_api_token: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
data.local_file.kubeconfig: Reading...
data.local_file.kubeconfig: Read complete after 0s [id=e8e9d6301d5e9261409aef623945966463087ba8]
kubectl_manifest.traefik_config: Refreshing state... [id=/apis/helm.cattle.io/v1/namespaces/kube-system/helmchartconfigs/traefik]
kubernetes_config_map_v1.local_path_config: Refreshing state... [id=kube-system/local-path-config]
kubernetes_storage_class.local_path_retain: Refreshing state... [id=local-path-retain]
kubectl_manifest.local_path_provisioner_restart: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/deployments/local-path-provisioner]
kubectl_manifest.cluster_issuer_letsencrypt_prod: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-prod]
kubectl_manifest.wildcard_certificate_internal: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-internal]
kubectl_manifest.wildcard_certificate_public: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-public]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.cnpg_operator will be created
  + resource "helm_release" "cnpg_operator" {
      + atomic                     = false
      + chart                      = "cloudnative-pg"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cnpg"
      + namespace                  = "cnpg-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://cloudnative-pg.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "monitoring":
                  "podMonitorEnabled": false
            EOT,
        ]
      + verify                     = false
      + version                    = "0.22.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.digger will be created
  + resource "helm_release" "digger" {
      + atomic                     = false
      + chart                      = "digger-backend"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "digger"
      + namespace                  = "bootstrap"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://diggerhq.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.1.12"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.platform_pg will be created
  + resource "kubectl_manifest" "platform_pg" {
      + api_version             = "postgresql.cnpg.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Cluster"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "platform-pg"
      + namespace               = "platform"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: postgresql.cnpg.io/v1
            kind: Cluster
            metadata:
              labels:
                layer: Platform
              name: platform-pg
              namespace: platform
            spec:
              bootstrap:
                initdb:
                  database: vault
                  owner: postgres
                  postInitSQL:
                  - CREATE DATABASE casdoor;
                  - CREATE DATABASE digger;
                  - CREATE TABLE IF NOT EXISTS vault_kv_store (parent_path TEXT COLLATE "C" NOT
                    NULL, path TEXT COLLATE "C", key TEXT COLLATE "C", value BYTEA, CONSTRAINT
                    pkey PRIMARY KEY (path, key));
                  - CREATE INDEX IF NOT EXISTS parent_path_idx ON vault_kv_store (parent_path);
                  - CREATE TABLE IF NOT EXISTS vault_ha_locks (ha_key TEXT COLLATE "C" NOT NULL,
                    ha_identity TEXT COLLATE "C" NOT NULL, ha_value TEXT COLLATE "C", valid_until
                    TIMESTAMP WITH TIME ZONE NOT NULL, CONSTRAINT ha_key PRIMARY KEY (ha_key));
              instances: 1
              monitoring:
                enablePodMonitor: false
              postgresql:
                parameters:
                  effective_cache_size: 256MB
                  max_connections: "100"
                  shared_buffers: 128MB
                  wal_level: replica
              resources:
                limits:
                  cpu: 500m
                  memory: 512Mi
                requests:
                  cpu: 100m
                  memory: 128Mi
              storage:
                size: 10Gi
                storageClass: local-path-retain
              superuserSecret:
                name: platform-pg-superuser
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_secret.platform_pg_superuser will be created
  + resource "kubernetes_secret" "platform_pg_superuser" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "platform-pg-superuser"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # local_sensitive_file.ssh_key will be created
  + resource "local_sensitive_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "/tmp/infra-k3s.id_rsa"
      + id                   = (known after apply)
    }

  # time_sleep.wait_for_platform_pg will be created
  + resource "time_sleep" "wait_for_platform_pg" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

> **Applying changes...** ⏳